import express from "express";

import { articlesCreate } from "../controllers/articlesControllers.js";

const router = express.Router();

// POST /news - নতুন নিউজ যোগ করা
router.post("/", articlesCreate);

router.get("/", (req, res) => {
  res.json({
    status: "ok",
    success: true,
    totalResults: 4742,
    articles: [
      {
        category: "Business",
        source: {
          id: "lasetProdact123",
          name: "Internet",
          category: "Business",
        },
        author: "info@thehackernews.com (The Hacker News)",
        title: "টি-টোয়েন্টি সিরিজে ছক্কার নতুন বিশ্ব রেকর্ড",
        description:
          "হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার ",
        url: "/Details",
        urlToImage:
          "https://asset.news24bd.tv/public/news_images/2026/01/23/thumbnails/1769161485-9ff11ba7859ea2d71ea52fe60df7ee67.jpg?w=828&q=100",
        publishedAt: new Date(),
        content: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।
শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে সাঞ্জু স্যামসনকে হারানোর পর তিন নম্বরে ক্রিজে আসেন কিষান। প্রথম ৫ বলে মাত্র ১ রান করা এই ব্যাটসম্যান লকি ফার্গুসনকে চার ও ছক্কা মেরে হাত খোলা শুরু করেন। ফিফটি পূর্ণ করতে ২৮ বল নিলেও পরের ১৪ বলেই পৌঁছে যান তিন অঙ্কের ঘরে। ৪৩ বলে ১০৩ রানের এই ইনিংসে ছিল ১০টি ছক্কা ও ৬টি চার।

`,
        summary: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে `,

        metaTitle: "হালকা চোট কাটিয়ে একাদশে ফিরেই",
        metaDescription: "র রীতিমতো তাণ্ডব চালালেন",
        focusKeyword: "সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে ",

        likes: {
          totalLikes: 53,
          likes: false,
        },
        share: {
          totalShare: 33,
          urlToShare: "",
        },
        comments: {
          totalComments: 458983,
        },
      },
      {
        category: "UK",
        source: {
          id: "lasetProdact123",
          name: "Internet",
          category: "Business",
        },
        author: "info@thehackernews.com (The Hacker News)",
        title: "টি-টোয়েন্টি সিরিজে ছক্কার নতুন বিশ্ব রেকর্ড",
        description:
          "হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার ",
        url: "/Details",
        urlToImage:
          "https://asset.news24bd.tv/public/news_images/2026/01/23/thumbnails/1769161485-9ff11ba7859ea2d71ea52fe60df7ee67.jpg?w=828&q=100",
        publishedAt: new Date(),
        content: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।
শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে সাঞ্জু স্যামসনকে হারানোর পর তিন নম্বরে ক্রিজে আসেন কিষান। প্রথম ৫ বলে মাত্র ১ রান করা এই ব্যাটসম্যান লকি ফার্গুসনকে চার ও ছক্কা মেরে হাত খোলা শুরু করেন। ফিফটি পূর্ণ করতে ২৮ বল নিলেও পরের ১৪ বলেই পৌঁছে যান তিন অঙ্কের ঘরে। ৪৩ বলে ১০৩ রানের এই ইনিংসে ছিল ১০টি ছক্কা ও ৬টি চার।

`,
        summary: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে `,

        metaTitle: "হালকা চোট কাটিয়ে একাদশে ফিরেই",
        metaDescription: "র রীতিমতো তাণ্ডব চালালেন",
        focusKeyword: "সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে ",

        likes: {
          totalLikes: 53,
          likes: false,
        },
        share: {
          totalShare: 33,
          urlToShare: "",
        },
        comments: {
          totalComments: 458983,
        },
      },
      {
        category: "Politics",
        source: {
          id: "lasetProdact123",
          name: "Internet",
          category: "Business",
        },
        author: "info@thehackernews.com (The Hacker News)",
        title: "টি-টোয়েন্টি সিরিজে ছক্কার নতুন বিশ্ব রেকর্ড",
        description:
          "হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার ",
        url: "/Details",
        urlToImage:
          "https://asset.news24bd.tv/public/news_images/2026/01/23/thumbnails/1769161485-9ff11ba7859ea2d71ea52fe60df7ee67.jpg?w=828&q=100",
        publishedAt: new Date(),
        content: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।
শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে সাঞ্জু স্যামসনকে হারানোর পর তিন নম্বরে ক্রিজে আসেন কিষান। প্রথম ৫ বলে মাত্র ১ রান করা এই ব্যাটসম্যান লকি ফার্গুসনকে চার ও ছক্কা মেরে হাত খোলা শুরু করেন। ফিফটি পূর্ণ করতে ২৮ বল নিলেও পরের ১৪ বলেই পৌঁছে যান তিন অঙ্কের ঘরে। ৪৩ বলে ১০৩ রানের এই ইনিংসে ছিল ১০টি ছক্কা ও ৬টি চার।

`,
        summary: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে `,

        metaTitle: "হালকা চোট কাটিয়ে একাদশে ফিরেই",
        metaDescription: "র রীতিমতো তাণ্ডব চালালেন",
        focusKeyword: "সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে ",

        likes: {
          totalLikes: 53,
          likes: false,
        },
        share: {
          totalShare: 33,
          urlToShare: "",
        },
        comments: {
          totalComments: 458983,
        },
      },
      {
        category: "Sport",
        source: {
          id: "lasetProdact123",
          name: "Internet",
          category: "Business",
        },
        author: "info@thehackernews.com (The Hacker News)",
        title: "টি-টোয়েন্টি সিরিজে ছক্কার নতুন বিশ্ব রেকর্ড",
        description:
          "হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার ",
        url: "/Details",
        urlToImage:
          "https://asset.news24bd.tv/public/news_images/2026/01/23/thumbnails/1769161485-9ff11ba7859ea2d71ea52fe60df7ee67.jpg?w=828&q=100",
        publishedAt: new Date(),
        content: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।
শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে সাঞ্জু স্যামসনকে হারানোর পর তিন নম্বরে ক্রিজে আসেন কিষান। প্রথম ৫ বলে মাত্র ১ রান করা এই ব্যাটসম্যান লকি ফার্গুসনকে চার ও ছক্কা মেরে হাত খোলা শুরু করেন। ফিফটি পূর্ণ করতে ২৮ বল নিলেও পরের ১৪ বলেই পৌঁছে যান তিন অঙ্কের ঘরে। ৪৩ বলে ১০৩ রানের এই ইনিংসে ছিল ১০টি ছক্কা ও ৬টি চার।

`,
        summary: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে `,

        metaTitle: "হালকা চোট কাটিয়ে একাদশে ফিরেই",
        metaDescription: "র রীতিমতো তাণ্ডব চালালেন",
        focusKeyword: "সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে ",

        likes: {
          totalLikes: 53,
          likes: false,
        },
        share: {
          totalShare: 33,
          urlToShare: "",
        },
        comments: {
          totalComments: 458983,
        },
      },
      {
        category: "Science",
        source: {
          name: "Info 24",
          logo: "https://asset.news24bd.tv/public/news_images/2026/01/23/thumbnails/1769161485-9ff11ba7859ea2d71ea52fe60df7ee67.jpg?w=828&q=100",
          url: "http://localhost:5173/",
          type: "newspaper",
        },

        author: "info@thehackernews.com (The Hacker News)",
        title: "টি-টোয়েন্টি সিরিজে ছক্কার নতুন বিশ্ব রেকর্ড",
        description:
          "হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার ",
        url: "/Details",
        urlToVideo: `c:\Users\iqbal\OneDrive\Desktop\Ho Gaya Hai Tujhko To Pyar Sajna MP3 Song Download - Dilwale Dulhania Le Jayenge.mp4`,
        urlToImage:
          "https://asset.news24bd.tv/public/news_images/2026/01/23/thumbnails/1769161485-9ff11ba7859ea2d71ea52fe60df7ee67.jpg?w=828&q=100",
        publishedAt: new Date(),
        content: `গৃহকর্মী নির্যাতনের অভিযোগে বিমান বাংলাদেশ এয়ারলাইনসের ব্যবস্থাপনা পরিচালককে স্ত্রীসহ গ্রেফতার করেছে পুলিশ। টিআইবি তাদের সবশেষ প্রতিবেদনে জানিয়েছে, ত্রয়োদশ জাতীয় সংসদ নির্বাচনের তফসিল ঘোষণার ৩৬ দিনের মধ্যে দেশে অন্তত ১৫ জন রাজনৈতিক কর্মী নিহত হয়েছেন। বাংলাদেশে আরো বেড়েছে এলপি গ্যাসের দাম। সবশেষ খবর জানতে চোখ রাখুন `,
        summary: `হালকা চোট কাটিয়ে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর রীতিমতো তাণ্ডব চালালেন ইশান কিষান। সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে এই বাঁহাতি ওপেনারের বিধ্বংসী সেঞ্চুরি এবং সূর্যকুমার যাদবের ঝোড়ো ব্যাটিংয়ে ছক্কার বিশ্বরেকর্ড গড়েছে ভারত। কিষানের ৪২ বলের এই খুনে সেঞ্চুরি ভারতকে এনে দিয়েছে বড় সংগ্রহ।শনিবার (৩১ জানুয়ারি) থিরুভানান্থাপুরামে টস জিতে ব্যাটিংয়ে নেমে তৃতীয় ওভারে `,

        SEO: {
          metaTitle:
            "হালকা চোট কাটিয়ে একাদশে ফিরেই একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর ",
          metaDescription:
            "র রীতিমতো তাণ্ডব চালালেন একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর ",
          focusKeyword:
            "সিরিজের পঞ্চম ও শেষ টি-টোয়েন্টিতে একাদশে ফিরেই নিউজিল্যান্ডের বোলারদের ওপর ",
          score: 49,
        },
        likes: {
          totalLikes: 53,
          likes: false,
        },
        share: {
          totalShare: 33,
          urlToShare: "",
        },
        comments: {
          totalComments: 458983,
        },
      },
    ],
  });
});

export default router;
